cases/floating/rotational_y/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	format		ascii;
	class		volVectorField;
	object		U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions	[0 1 -1 0 0 0 0];

internalField	uniform (0 0 0);

boundaryField
{
	minY
	{
		type	noSlip;
	}

	maxY
	{
		type	noSlip;
	}

	outside
	{
		type	noSlip;
	}
	
    	surface
	{
		type	symmetry;
	}
	
	stlsurface
	{
		type	movingWallVelocity;
		value	uniform (0 0 0);
	}
}


